Sonos.indigoPlugin/Contents/Resources/validate.xml

<?xml version="1.0" encoding="utf-8"?>
<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
    <s:Header>
        <credentials xmlns="http://www.sonos.com/Services/1.1">
            <deviceId>B8-E9-37-3D-43-E4:3</deviceId>
            <deviceProvider>Sonos</deviceProvider>
        </credentials>
    </s:Header>
    <s:Body>
        <getSessionId xmlns="http://www.sonos.com/Services/1.1">
            <username>jrpatric@gmail.com</username>
            <password>gxakL7hN9FDB$</password>
        </getSessionId>
    </s:Body>
</s:Envelope>